Catalogs/ВидыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыОтпусков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтпускЯвляетсяЕжегодным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьОтпускВсемСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопительныйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗависимостиДнейОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаОценкиСтажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервалаСтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыИнструктажейПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыИнструктажейПоОхранеТруда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролироватьПроведениеИнструктажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитсяПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляВсехРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОхранаТрудаФормы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Охрана труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьВМассивСоздаваемыеРеквизитыФормыСотрудника(МассивДобавляемыхРеквизитов) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДобавляемыйРеквизит Из МассивДобавляемыхРеквизитов Цикл
		Если ДобавляемыйРеквизит.Имя = "РабочееМестоОхраныТруда" Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РабочееМестоОхраныТруда", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"), , НСтр("ru='Рабочее место'"), Ложь));
	
КонецПроцедуры

Процедура ФормаСотрудникаДобавитьЭлементыФормы(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементГруппаРабочееМесто = Форма.Элементы.Найти("РабочееМесто");
	Если ЭлементГруппаРабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("ТекущееРабочееМесто");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить(
			"ТекущееРабочееМесто",
			Тип("ПолеФормы"),
			ЭлементГруппаРабочееМесто,
			Форма.Элементы.ТекущееПодразделение);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.ПутьКДанным = "РабочееМестоОхраныТруда";
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаДоступнаПользователю() Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Команды.Найти("ОхранаТруда") = Неопределено Тогда
		КомандаОхранаТруда = Форма.Команды.Добавить("ОхранаТруда");
		КомандаОхранаТруда.Действие = "Подключаемый_ОхранаТруда";
		КомандаОхранаТруда.Заголовок = НСтр("ru = 'Охрана труда'");
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ОхранаТруда") = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("ОхранаТруда", Тип("КнопкаФормы"), Форма.Элементы.ГруппаОхранаТруда);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = "ОхранаТруда"; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормаКадровойИсторииПриСозданииНаСервере(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ФормаКадровойИсторииДобавитьЭлементыФормы(Форма);
	ДополнитьКадровуюИсториюРабочимиМестами(Форма);
	ФормаКадровойИсторииУстановитьЭлементУсловногоОформления(Форма);
	
КонецПроцедуры

Процедура ПриСозданииФормСпискаИлиВыбораСотрудников(Форма, ИмяСледующегоЭлемента, ТолькоПросмотр = Истина) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписок = Форма.Элементы.Найти("Список");
	Если ЭлементСписок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("РабочееМесто");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("РабочееМесто",
										Тип("ПолеФормы"),
										ЭлементСписок,
										Форма.Элементы[ИмяСледующегоЭлемента]);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ТолькоПросмотр = ТолькоПросмотр;
		Элемент.ПутьКДанным = "Список.РабочееМесто";
	КонецЕсли;
	
КонецПроцедуры

Функция ОтпускаПоРабочемуМесту(ДанныеПозиции) Экспорт
	
	ТаблицаОтпусков = Новый ТаблицаЗначений;
	
	ТаблицаОтпусков.Колонки.Добавить("ВидЕжегодногоОтпуска");
	ТаблицаОтпусков.Колонки.Добавить("КоличествоДнейВГод");
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат ТаблицаОтпусков;
	КонецЕсли;
	
	Если Не ДанныеПозиции.Свойство("РабочееМесто") Тогда
		Возврат ТаблицаОтпусков;
	КонецЕсли;
	
	ОтпускЗаВредность = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускЗаВредность");
	Если НЕ ЗначениеЗаполнено(ОтпускЗаВредность) Тогда
		Возврат ТаблицаОтпусков;
	КонецЕсли;
	
	РеквизитыОтпуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтпускЗаВредность, "ПометкаУдаления,Недействителен");
	Если РеквизитыОтпуска.ПометкаУдаления ИЛИ РеквизитыОтпуска.Недействителен Тогда
		Возврат ТаблицаОтпусков;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеПозиции.РабочееМесто) Тогда
		Возврат ТаблицаОтпусков;
	КонецЕсли;
			
	РеквизитыУсловийТруда = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПозиции.РабочееМесто, "ВыплачиваетсяНадбавкаЗаВредность,КоличествоДнейДополнительногоОтпускаВГод");
	Если РеквизитыУсловийТруда.ВыплачиваетсяНадбавкаЗаВредность И ЗначениеЗаполнено(РеквизитыУсловийТруда.КоличествоДнейДополнительногоОтпускаВГод) Тогда
		СтрокаВредногоОтпуска = ТаблицаОтпусков.Добавить();
		СтрокаВредногоОтпуска.ВидЕжегодногоОтпуска = ОтпускЗаВредность;
		СтрокаВредногоОтпуска.КоличествоДнейВГод = РеквизитыУсловийТруда.КоличествоДнейДополнительногоОтпускаВГод;
	КонецЕсли; 
	
	Возврат ТаблицаОтпусков;
	
КонецФункции

Процедура ПроверитьЗаполнениеРабочегоМеста(Форма, ЗаполнятьПоложенными) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьПоложенными = ЗаполнятьПоложенными Или ЗначениеЗаполнено(Форма.Объект.РабочееМесто);
	
КонецПроцедуры

Процедура ДополнитьДанныеПозицииРабочимМестом(Форма, ДанныеНовойПозиции, ДанныеПрошлойПозиции = Неопределено) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНовойПозиции.Вставить("РабочееМесто", Форма.Объект.РабочееМесто);
	
	Если ДанныеПрошлойПозиции <> Неопределено Тогда
		ДанныеПрошлойПозиции.Вставить("РабочееМесто", Форма.ТекущееРабочееМесто);
	КонецЕсли;
	
КонецПроцедуры

Процедура УточнитьПараметрыОтбораФормыВыбораСотрудников(Форма, СписокНастройкиОтбора = Неопределено) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Неопределено;
	
	Если Форма.Параметры.Отбор.Свойство("РабочееМесто")
		И ЗначениеЗаполнено(Форма.Параметры.Отбор.РабочееМесто) Тогда
		
		// Отбор по рабочему месту
		РабочееМесто = Форма.Параметры.Отбор.РабочееМесто;
		
		Если СписокНастройкиОтбора <> Неопределено Тогда
			Форма.ФилиалЗафиксирован = Истина;
			СписокНастройкиОтбора.Добавить(НСтр("ru='Рабочее место'") + ": " + РабочееМесто);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, "Владелец,Подразделение");
		УстановитьПривилегированныйРежим(Ложь);
		
		Филиал = ДанныеРабочегоМеста.Владелец;
		Форма.Организация = ЗарплатаКадры.ГоловнаяОрганизация(Филиал);
		
		ПодразделенияОтбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеРабочегоМеста.Подразделение);
		Форма.Подразделения = Новый ФиксированныйМассив(ПодразделенияОтбора);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Список, "РабочееМесто", РабочееМесто,ВидСравненияКомпоновкиДанных.Равно,
			"РабочееМесто", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		Форма.Параметры.Отбор.Удалить("РабочееМесто");
	
	КонецЕсли;
			
КонецПроцедуры

#Область КадровыйУчет

Процедура ДополнитьФормуКадровогоПриказа(Форма, УстановитьДействие = Истина, ЭтоТабличнаяЧасть = Ложь) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементГруппаРабочееМесто = Форма.Элементы.Найти("ГруппаРабочееМесто");
	Если ЭлементГруппаРабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("РабочееМесто");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("РабочееМесто", Тип("ПолеФормы"), ЭлементГруппаРабочееМесто);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Если ЭтоТабличнаяЧасть Тогда
			Элемент.ПутьКДанным = "Объект.Сотрудники.РабочееМесто";
		Иначе
			Элемент.ПутьКДанным = "Объект.РабочееМесто";
		КонецЕсли;
		Если УстановитьДействие Тогда
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РабочееМестоПриИзменении");
			Элемент.УстановитьДействие("Очистка", "Подключаемый_РабочееМестоОчистка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура КадровыйПереводДополнитьФорму(Форма, ДобавлятьЭлементыФормы = Истина, ДобавлятьРеквизитыФормы = Истина, ОтложенноеИзменение = Ложь) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПозицияГруппа = Форма.Элементы.Найти("ПозицияГруппа");
	Если ЭлементПозицияГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ДобавлятьРеквизитыФормы Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РабочееМестоКомментарий", Новый ОписаниеТипов("Строка")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекущееРабочееМесто",
			Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда")));
		МассивИменРеквизитовФормы = Новый Массив;
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
		ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы,, ОтложенноеИзменение);
	КонецЕсли;
	
	Если ДобавлятьЭлементыФормы Тогда
		ЭлементРабочееМестоГруппа = Форма.Элементы.Найти("РабочееМестоГруппа");
		Если ЭлементРабочееМестоГруппа = Неопределено Тогда
			ЭлементРабочееМестоГруппа = Форма.Элементы.Вставить("РабочееМестоГруппа", Тип("ГруппаФормы"),
				ЭлементПозицияГруппа, Форма.Элементы.ПозицияКомментарий);
			ЭлементРабочееМестоГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементРабочееМестоГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлементРабочееМестоГруппа.ОтображатьЗаголовок = Ложь;
			ЭлементРабочееМестоГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		КонецЕсли;
		
		Элемент = Форма.Элементы.Найти("ИзменитьРабочееМесто");
		Если Элемент = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("ИзменитьРабочееМесто", Тип("ПолеФормы"), ЭлементРабочееМестоГруппа);
			Элемент.ШрифтЗаголовка = ШрифтыСтиля.ВажнаяНадписьШрифт;
			Элемент.Вид = ВидПоляФормы.ПолеФлажка;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			Элемент.ПутьКДанным = "Объект.ИзменитьРабочееМесто";
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИзменитьРабочееМестоПриИзменении");
		КонецЕсли;
		
		Элемент = Форма.Элементы.Найти("РабочееМесто");
		Если Элемент = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("РабочееМесто", Тип("ПолеФормы"), ЭлементРабочееМестоГруппа);
			Элемент.Вид = ВидПоляФормы.ПолеФлажка;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.ПутьКДанным = "Объект.РабочееМесто";
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РабочееМестоПриИзменении");
			Элемент.УстановитьДействие("Очистка", "Подключаемый_РабочееМестоОчистка");
		КонецЕсли;
		
		ЭлементРабочееМестоКомментарийГруппа = Форма.Элементы.Найти("РабочееМестоКомментарийГруппа");
		Если ЭлементРабочееМестоКомментарийГруппа = Неопределено Тогда
			ЭлементРабочееМестоКомментарийГруппа = Форма.Элементы.Вставить("РабочееМестоКомментарийГруппа",
				Тип("ГруппаФормы"), ЭлементПозицияГруппа, Форма.Элементы.ПозицияКомментарий);
			ЭлементРабочееМестоКомментарийГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементРабочееМестоКомментарийГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлементРабочееМестоКомментарийГруппа.ОтображатьЗаголовок = Ложь;
			ЭлементРабочееМестоКомментарийГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		КонецЕсли;
	
		Элемент = Форма.Элементы.Найти("РабочееМестоКомментарий");
		Если Элемент = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("РабочееМестоКомментарий", Тип("ПолеФормы"), ЭлементРабочееМестоКомментарийГруппа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.ПутьКДанным = "РабочееМестоКомментарий";
			Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
			Элемент.Видимость = Ложь;
			Элемент.РастягиватьПоГоризонтали = Истина;
			Элемент.РастягиватьПоВертикали = Ложь;
			Элемент.Высота = 2;
			Элемент.АвтоМаксимальнаяШирина = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура КадровыйПереводСпискомДополнитьФорму(Форма) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРеквизитыСтроки = Форма.Элементы.Найти("СотрудникиРеквизитыСтрокиГруппа");
	Если ЭлементРеквизитыСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("СотрудникиРабочееМесто");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("СотрудникиРабочееМесто",
										Тип("ПолеФормы"),
										ЭлементРеквизитыСтроки,
										Форма.Элементы.СотрудникиДатаНачала);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Сотрудники.РабочееМесто";
	КонецЕсли;
	
КонецПроцедуры

Процедура КадровыйПереводСотрудникПриИзменении(Форма) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Объект.ИзменитьРабочееМесто = Ложь;
	
КонецПроцедуры

Процедура ДобавитьПоляОтбораПериодическихДанных(ПоляОтбораПериодическихДанных, Отбор) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ПоляОтбораПериодическихДанных.Вставить("РабочиеМестаСотрудников", Отбор);
	
КонецПроцедуры

Процедура ДобавитьКлючиСтруктурыТекущихКадровыхДанныхСотрудника(КлючиСтруктурыТекущихКадровыхДанныхСотрудника) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	КлючиСтруктурыТекущихКадровыхДанныхСотрудника = КлючиСтруктурыТекущихКадровыхДанныхСотрудника + ",РабочееМестоОхраныТруда";
	
КонецПроцедуры

Процедура УстановитьТекущееРабочееМесто(ОбъектДанных, ТекущиеКадровыеДанные = Неопределено, ИмяПоля = "ТекущееРабочееМесто") Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектДанных, ИмяПоля) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДанных[ИмяПоля] = ?(ТекущиеКадровыеДанные = Неопределено,
							Справочники.РабочиеМестаОхраныТруда.ПустаяСсылка(),
							ТекущиеКадровыеДанные.РабочееМестоОхраныТруда);
	
КонецПроцедуры

Процедура КадровыйПереводДополнитьРасшифровкуСтрокиСотрудника(Форма, ИдентификаторСтрокиСотрудника, ТекстРасшифровки) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтрокиСотрудника);
	
	Если СтрокаСотрудника.ИзменитьРабочееМесто Тогда
		ТекстРасшифровки = ?(ПустаяСтрока(ТекстРасшифровки), "", ТекстРасшифровки + "; ") + НСтр("ru='Изменено рабочее место'");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПослеЗаписиФормыКадровогоДокументаНаСервере(ДокументОбъект, СотрудникиМассив) Экспорт
	МедицинскиеОсмотры.ЗапуститьОбновлениеПериодическихОсмотров();
КонецПроцедуры

Процедура УстановитьРабочееМестоВФормеДокумента(Форма, ЭтоПеревод = Ложь) Экспорт
	
	УстановитьЗначениеРабочегоМестаВФормеДокумента(Форма, ЭтоПеревод);
	УстановитьСвойстваЭлементаРабочееМестоВФормеДокумента(Форма, ЭтоПеревод);
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементаРабочееМестоВФормеДокумента(Форма, ЭтоПеревод = Ложь) Экспорт

	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Подразделение");
	Организация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Организация");
	Должность = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Должность");
	
	РабочееМестоДоступно = ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Должность);
	
	Если РабочееМестоДоступно И ЭтоПеревод Тогда
		РабочееМестоДоступно = РабочееМестоДоступно
			И ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "РабочееМесто", "Доступность", РабочееМестоДоступно);
	
	Если Не ЭтоПеревод Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИзменитьРабочееМесто", "Доступность", Истина);
	
	ТекущееРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ТекущееРабочееМесто");
	Если Не ЗначениеЗаполнено(ТекущееРабочееМесто) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееПодразделение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ТекущееПодразделение");
	ТекущаяДолжность = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ТекущаяДолжность");
	Если ТекущееПодразделение = Подразделение И ТекущаяДолжность = Должность Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТекущегоРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущееРабочееМесто, "Должность, Подразделение", Истина);
	Если Не (ДанныеТекущегоРабочегоМеста.Подразделение = Подразделение И ДанныеТекущегоРабочегоМеста.Должность = Должность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИзменитьРабочееМесто", "Доступность", Ложь);
	КонецЕсли;
	
КонецПроцедуры 

Процедура УстановитьЗначениеРабочегоМестаВФормеДокумента(Форма, ЭтоПеревод = Ложь) Экспорт

	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Подразделение");
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", Неопределено);
		Возврат;
	КонецЕсли;
	
	Должность = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Должность");
	
	РабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто");
	ДанныеРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, "Должность, Подразделение", Истина);
	Если Не (ДанныеРабочегоМеста.Подразделение = Подразделение И ДанныеРабочегоМеста.Должность = Должность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", Неопределено);
	КонецЕсли;
	
	Владелец = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Организация");
	СписокРабочихМест = ОхранаТруда.РабочиеМестаПоПодразделениюИДолжности(Подразделение, Должность, Владелец);
	КоличествоРабочихМест = СписокРабочихМест.Количество();
	
	Если КоличествоРабочихМест = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", СписокРабочихМест[0].Значение);
	ИначеЕсли КоличествоРабочихМест = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", Неопределено);
	КонецЕсли;
	
	Если Не ЭтоПеревод Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ТекущееРабочееМесто");
	Если КоличествоРабочихМест > 1 Тогда
		ИзменитьРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто");
		Если Не ИзменитьРабочееМесто И Не ТекущееРабочееМесто = РабочееМесто Тогда
			ДанныеТекущегоРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущееРабочееМесто, "Должность, Подразделение", Истина);
			Если Не (ДанныеТекущегоРабочегоМеста.Подразделение = Подразделение И ДанныеТекущегоРабочегоМеста.Должность = Должность) Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", Неопределено);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто", ТекущееРабочееМесто);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	НовоеРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.РабочееМесто");
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто", Не ТекущееРабочееМесто = НовоеРабочееМесто);
	
КонецПроцедуры 

Процедура ПереопределитьДанныеДолжностиВФорме(Форма, ДанныеДолжности, ТекущаяДолжность) Экспорт
	
	ЭтоПеревод = Ложь;
	
	РабочееМесто = ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, ЭтоПеревод);
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность,Должность,Подразделение";
	
	ДанныеРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, ИменаРеквизитов, Истина);
	
	Для Каждого КлючИЗначение Из ДанныеДолжности Цикл
		Если ЭтоПеревод И ЗначениеЗаполнено(ТекущаяДолжность) И ТекущаяДолжность = КлючИЗначение.Ключ Тогда
			Если ЗначениеЗаполнено(Форма.ТекущееРабочееМесто) Тогда
				ДанныеТекущегоРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.ТекущееРабочееМесто, ИменаРеквизитов);
			Иначе
				ДанныеТекущегоРабочегоМеста = Новый Структура(ИменаРеквизитов, Ложь, 0);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение, ДанныеТекущегоРабочегоМеста, , "Должность,Подразделение");
		Иначе
			Если Не (ДанныеРабочегоМеста.Подразделение = КлючИЗначение.Значение.Подразделение
				   И ДанныеРабочегоМеста.Должность = КлючИЗначение.Значение.Должность) Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение, ДанныеРабочегоМеста, , "Должность,Подразделение");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереопределитьДанныеНадбавкиЗаВредность(Форма, ДанныеДолжности, Должность, Сотрудник, ДатаСведений) Экспорт
	
	ИзменитьРабочееМесто = Ложь;
	
	РабочееМесто = ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, , ИзменитьРабочееМесто);
	Если РабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РабочееМесто) И Не ИзменитьРабочееМесто Тогда
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "РабочееМестоОхраныТруда", ДатаСведений, , Ложь);
		Если КадровыеДанные.Количество() > 0 Тогда
			РабочееМесто = КадровыеДанные[0].РабочееМестоОхраныТруда;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ДанныеУсловийТруда = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Должность, "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность");
	Иначе
		ДанныеУсловийТруда = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеДолжности, ДанныеУсловийТруда);
	
КонецПроцедуры

#КонецОбласти

#Область ПозицияШтатногоРасписания

Процедура ДополнитьФормуПозицииШтатногоРасписания(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ДобавляемыеРеквизиты = Новый Массив;
	// Инструктажи
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИнструктажиПоРабочимМестам", Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Инструктаж", Новый ОписаниеТипов("СправочникСсылка.ВидыИнструктажейПоОхранеТруда"), "ИнструктажиПоРабочимМестам"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Период", ОбщегоНазначения.ОписаниеТипаСтрока(50), "ИнструктажиПоРабочимМестам"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Используется", Новый ОписаниеТипов("Булево"), "ИнструктажиПоРабочимМестам"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользуетсяДляВсехРабочихМест", Новый ОписаниеТипов("Булево"), "ИнструктажиПоРабочимМестам"));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда")
		И ПравоДоступа("Чтение", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда) Тогда
		
		ГруппаИнструктажи = Элементы.ГруппаИнструктажиПоОхранеТруда;
		ТаблицаИнструктажей = Элементы.Найти("ИнструктажиПоРабочимМестам");
		Если ТаблицаИнструктажей = Неопределено Тогда
			ТаблицаИнструктажей = Элементы.Добавить("ИнструктажиПоРабочимМестам", Тип("ТаблицаФормы"), ГруппаИнструктажи);
			ТаблицаИнструктажей.ПутьКДанным = "ИнструктажиПоРабочимМестам";
			ТаблицаИнструктажей.Отображение = ОтображениеТаблицы.Список;
			ТаблицаИнструктажей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			ТаблицаИнструктажей.КонтекстноеМеню.Видимость = Ложь;
			ТаблицаИнструктажей.ИзменятьСоставСтрок = Ложь;
			ТаблицаИнструктажей.ИзменятьПорядокСтрок = Ложь;
			ТаблицаИнструктажей.Шапка = Ложь;;
		КонецЕсли;
		Если Элементы.Найти("ИнструктажиПоРабочимМестамИспользуется") = Неопределено Тогда
			Элемент = Элементы.Добавить("ИнструктажиПоРабочимМестамИспользуется", Тип("ПолеФормы"), ТаблицаИнструктажей);
			Элемент.ПутьКДанным = "ИнструктажиПоРабочимМестам.Используется";
			Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		Если Элементы.Найти("ИнструктажиПоРабочимМестамИнструктаж") = Неопределено Тогда
			Элемент = Элементы.Добавить("ИнструктажиПоРабочимМестамИнструктаж", Тип("ПолеФормы"), ТаблицаИнструктажей);
			Элемент.ПутьКДанным = "ИнструктажиПоРабочимМестам.Инструктаж";
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Элементы.Найти("ИнструктажиПоРабочимМестамПериод") = Неопределено Тогда
			Элемент = Элементы.Добавить("ИнструктажиПоРабочимМестамПериод", Тип("ПолеФормы"), ТаблицаИнструктажей);
			Элемент.ПутьКДанным = "ИнструктажиПоРабочимМестам.Период";
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнструктажиПоРабочимМестамИспользуется");
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИнструктажиПоРабочимМестам.ИспользуетсяДляВсехРабочихМест");
		ЭлементОтбора.ПравоеЗначение = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеЗначенияПозицииШтатногоРасписания(Форма, РабочееМесто) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда")
		И ПравоДоступа("Чтение", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Используется,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода КАК Период,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест КАК ИспользуетсяДляВсехРабочихМест
		|ИЗ
		|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
		|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведениеИнструктажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыИнструктажейПоОхранеТруда.Ссылка,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест";
		
		Форма.ИнструктажиПоРабочимМестам.Очистить();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Форма.ИнструктажиПоРабочимМестам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеЗначенияПозицииШтатногоРасписания(Форма, СсылкаНаОбъект) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда")
		И ПравоДоступа("Изменение", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИнструктажиПоРабочимМестам", Форма.ИнструктажиПоРабочимМестам.Выгрузить());
		Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнструктажиПоРабочимМестам.Инструктаж,
		|	ИнструктажиПоРабочимМестам.Используется
		|ПОМЕСТИТЬ ВТИнструктажиПоРабочимМестам
		|ИЗ
		|	&ИнструктажиПоРабочимМестам КАК ИнструктажиПоРабочимМестам
		|ГДЕ
		|	НЕ ИнструктажиПоРабочимМестам.ИспользуетсяДляВсехРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Используется,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода КАК Период,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест КАК ИспользуетсяДляВсехРабочихМест
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
		|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведениеИнструктажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыИнструктажейПоОхранеТруда.Ссылка,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнструктажиПоРабочимМестам.Инструктаж,
		|	ИнструктажиПоРабочимМестам.Используется
		|ИЗ
		|	ВТИнструктажиПоРабочимМестам КАК ИнструктажиПоРабочимМестам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанные КАК Данные
		|		ПО ИнструктажиПоРабочимМестам.Инструктаж = Данные.Инструктаж
		|ГДЕ
		|	НЕ Данные.ИспользуетсяДляВсехРабочихМест
		|	И ИнструктажиПоРабочимМестам.Используется <> Данные.Используется";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				ЗаблокироватьДанныеДляРедактирования(Выборка.Инструктаж);
			Исключение
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось заблокировать вид инструктажа ""%1"":
					|%2'"),
					Строка(Выборка.Инструктаж),
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецПопытки;
			
			ИнструктажОбъект = Выборка.Инструктаж.ПолучитьОбъект();
			Если Выборка.Используется Тогда
				НоваяСтрока = ИнструктажОбъект.РабочиеМеста.Добавить();
				НоваяСтрока.РабочееМесто = СсылкаНаОбъект;
			Иначе
				ОтборСтрок = Новый Структура("РабочееМесто", СсылкаНаОбъект);
				НайденныеСтроки = ИнструктажОбъект.РабочиеМеста.НайтиСтроки(ОтборСтрок);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ИнструктажОбъект.РабочиеМеста.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЕсли;
			ИнструктажОбъект.Записать();			
			РазблокироватьДанныеДляРедактирования(Выборка.Инструктаж);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СпециальнаяОценкаУсловийТруда

Функция КлассыУсловийТрудаДоступныДляИзменения() Экспорт
	Возврат Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда");
КонецФункции

#КонецОбласти

#Область Периодичность

Процедура ПериодичностьДополнитьФорму(Форма) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СписокВыбораПериодов", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПроизвольноеЗначениеСпискаВыбора", Новый ОписаниеТипов("Строка")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораПериода(Форма, ИмяЭлементаФормы, СписокВыбораПериодов, ПроизвольноеЗначениеСпискаВыбораПериодов) Экспорт
	
	СписокВыбораЭлементаФормы = Форма.Элементы[ИмяЭлементаФормы].СписокВыбора;
	СписокВыбораЭлементаФормы.Очистить();
	Форма.СписокВыбораПериодов.Очистить();
	
	Для каждого ЗначениеСписка Из СписокВыбораПериодов Цикл
		СписокВыбораЭлементаФормы.Добавить(?(ПустаяСтрока(ЗначениеСписка.Представление), ЗначениеСписка.Значение, ЗначениеСписка.Представление));
		Форма.СписокВыбораПериодов.Добавить(ЗначениеСписка.Значение, ЗначениеСписка.Представление);
	КонецЦикла;
	
	Форма.ПроизвольноеЗначениеСпискаВыбора = ПроизвольноеЗначениеСпискаВыбораПериодов;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ФормаКадровойИсторииДобавитьЭлементыФормы(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РегистраторРабочиеМеста",
														Документы.ТипВсеСсылки(),
														"КадроваяИстория"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РабочееМестоИзменено",
														Новый ОписаниеТипов("Булево"),
														"КадроваяИстория"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РабочееМесто",
														Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"),
														"КадроваяИстория",
														НСтр("ru = 'Рабочее место'")));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭлементКадроваяИстория = Форма.Элементы.Найти("КадроваяИстория");
	Если ЭлементКадроваяИстория = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("КадроваяИсторияРабочееМесто");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("КадроваяИсторияРабочееМесто",
										Тип("ПолеФормы"),
										ЭлементКадроваяИстория,
										Форма.Элементы.КадроваяИсторияГрафикРаботы);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.ПутьКДанным = "КадроваяИстория.РабочееМесто";
		Элемент.Подсказка = НСтр("ru = 'Рабочее место охраны труда'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКадровуюИсториюРабочимиМестами(Форма)
	
	КадроваяИстория = Форма.КадроваяИстория.Выгрузить();
	РабочиеМеста = КадроваяИстория.Скопировать();
	РабочиеМеста.Очистить();
	ИсключаемыеКолонки = ИсключаемыеКолонкиКадровойИстории(КадроваяИстория.Колонки);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Измерения = Новый ТаблицаЗначений;
	Измерения.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Измерения.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Измерения.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	СтрокаИзмерения = Измерения.Добавить();
	СтрокаИзмерения.Сотрудник = Форма.СсылкаНаСотрудника;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПериодыКадровойИстории.Период КАК Период,
		|	&Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПериодыКадровойИстории
		|ИЗ
		|	&КадроваяИстория КАК ПериодыКадровойИстории";
	Запрос.УстановитьПараметр("КадроваяИстория", КадроваяИстория);
	Запрос.УстановитьПараметр("Сотрудник", Форма.СсылкаНаСотрудника);
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"РабочиеМестаСотрудников",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(Измерения));
	
	ОхранаТруда.СоздатьВТКадроваяИсторияРабочиеМеста(Запрос);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	История.Период КАК Период,
		|	МАКСИМУМ(ИсторияПредыдущая.Период) КАК ПериодПредыдущий
		|ПОМЕСТИТЬ ВТПредыдущиеПериоды
		|ИЗ
		|	ВТКадроваяИсторияРабочиеМеста КАК История
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадроваяИсторияРабочиеМеста КАК ИсторияПредыдущая
		|		ПО История.Период > ИсторияПредыдущая.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	История.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ПериодПредыдущий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	История.Период КАК Период,
		|	История.ПериодКадроваяИстория КАК ПериодКадроваяИстория,
		|	История.РабочееМесто КАК РабочееМесто,
		|	ВЫБОР
		|		КОГДА История.РабочееМесто = ИсторияПредыдущие.РабочееМесто
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК РабочееМестоИзменено,
		|	История.РегистраторРабочиеМеста КАК РегистраторРабочиеМеста
		|ИЗ
		|	ВТКадроваяИсторияРабочиеМеста КАК История
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредыдущиеПериоды КАК ПредыдущиеПериоды
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКадроваяИсторияРабочиеМеста КАК ИсторияПредыдущие
		|			ПО ПредыдущиеПериоды.ПериодПредыдущий = ИсторияПредыдущие.Период
		|		ПО История.Период = ПредыдущиеПериоды.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		СтрокаНайдена = Ложь;
		Для каждого СтрокаКадроваяИстория Из КадроваяИстория Цикл
			Если Выборка.Период = СтрокаКадроваяИстория.Период Тогда			
				ЗаполнитьЗначенияСвойств(СтрокаКадроваяИстория, Выборка);
				Если ЗначениеЗаполнено(СтрокаКадроваяИстория.РегистраторРабочиеМеста) 
				   И СтрокаКадроваяИстория.Основания.НайтиПоЗначению(СтрокаКадроваяИстория.РегистраторРабочиеМеста) = Неопределено Тогда
					СтрокаКадроваяИстория.Основания.Добавить(СтрокаКадроваяИстория.РегистраторРабочиеМеста);
				КонецЕсли;				
				СтрокаНайдена = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла;		
		Если Не СтрокаНайдена Тогда
			Для каждого СтрокаКадроваяИстория Из КадроваяИстория Цикл
				Если Выборка.ПериодКадроваяИстория = СтрокаКадроваяИстория.Период Тогда
					НоваяСтрока = РабочиеМеста.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКадроваяИстория, , ИсключаемыеКолонки);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					Если ЗначениеЗаполнено(НоваяСтрока.РегистраторРабочиеМеста) Тогда
						НоваяСтрока.Основания.Добавить(НоваяСтрока.РегистраторРабочиеМеста);
					КонецЕсли;
					НоваяСтрока.КоличествоСтавокПредставление = КадровыйУчетКлиентСервер.ПредставлениеКоличестваСтавок(НоваяСтрока.КоличествоСтавок);					
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла; 
	
	Если РабочиеМеста.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РабочиеМеста, КадроваяИстория);
		КадроваяИстория.Сортировать("Период");
	КонецЕсли; 
	
	Форма.КадроваяИстория.Загрузить(КадроваяИстория);
	
КонецПроцедуры

Процедура ФормаКадровойИсторииУстановитьЭлементУсловногоОформления(Форма)
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
		
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КадроваяИсторияРабочееМесто");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУсловногоОформления.Отбор, "КадроваяИстория.РабочееМестоИзменено", Истина);
	
КонецПроцедуры

Функция ИсключаемыеКолонкиКадровойИстории(Колонки)
	
	ИсключаемыеКолонки = Новый Массив;
	ИсключаемыеКолонки.Добавить("Период");
	ИсключаемыеКолонки.Добавить("Основания");
	
	Для каждого Колонка Из Колонки Цикл
		Если СтрНайти(Колонка.Имя, "Изменен") = 0 И СтрНайти(Колонка.Имя, "Регистратор") = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ИсключаемыеКолонки.Добавить(Колонка.Имя);					
	КонецЦикла; 
	
	Возврат СтрСоединить(ИсключаемыеКолонки, ",");
	
КонецФункции

Функция ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, ЭтоПеревод = Ложь, ИзменитьРабочееМесто = Ложь)
	
	Если ДанныеДолжности = Неопределено Или Форма.Элементы.Найти("РабочееМесто") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПутьКРабочемуМесту = "Объект.РабочееМесто";
	ЭтоПеревод = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ИзменитьРабочееМесто");
	Если ЭтоПеревод Тогда
		ИзменитьРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто");
		Если Не ИзменитьРабочееМесто Тогда
			ПутьКРабочемуМесту = "ТекущееРабочееМесто";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКРабочемуМесту);
	
КонецФункции

#КонецОбласти
